## 데이터 전처리

- 1.이상치 삭제하기(item_price, item_cnt_day가 0보다 같거나 적은거 삭제)  
- 2.년(year), 월(month), 일(day) 로 date를 분리하기 
- 3.수입(income), 연일(y_m), 월일(m_d) 데이터 만들기

전체 데이터 2928492 개  / 
컬럼 11개
(date, shop_id, item_id, item_price, item_cnt_day, income, day, month, year, y_m, m_d)

In [ ]:
# 1. 데이터 불러오기

In [1]:
import pandas as pd

In [2]:
sales = pd.read_csv('sales.csv')

In [3]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2935849 entries, 0 to 2935848
Data columns (total 5 columns):
 #   Column        Dtype
---  ------        -----
 0   date          object
 1   shop_id       int64
 2   item_id       int64
 3   item_price    float64
 4   item_cnt_day  float64
dtypes: float64(2), int64(2), object(1)
memory usage: 112.0+ MB

In [4]:
sales.head()

         date  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013       59    22154      999.00           1.0
1  03.01.2013       25     2552      899.00           1.0
2  05.01.2013       25     2552      899.00          -1.0
3  06.01.2013       25     2554     1709.05           1.0
4  15.01.2013       25     2555     1099.00           1.0

In [5]:
# 1-1.'item_price'의 이상치 삭제하기

In [6]:
sales[sales['item_price'] <= 0].index[0]

484683

In [7]:
print(sales.iloc[484683])

date            15.05.2013
shop_id                 32
item_id               2973
item_price            -1.0
item_cnt_day           1.0
Name: 484683, dtype: object

In [8]:
sales[sales['item_price'] <= 0].index

Int64Index([484683], dtype='int64')

In [9]:
sales.drop(sales[sales['item_price'] <= 0].index, inplace=True)

In [10]:
sales[sales['item_price'] <= 0].index

Int64Index([], dtype='int64')

In [ ]:
# 1-2.'item_cnt_day'의 이상치 삭제하기

In [11]:
sales[sales['item_cnt_day'] <= 0].index[0]

2

In [12]:
sales[sales['item_cnt_day'] < 0].index

Int64Index([      2,     148,     175,     807,    1041,    1193,    1674,
               1825,    2411,    3216,
            ...
            2932589, 2932636, 2932721, 2933448, 2933712, 2934243, 2934462,
            2935263, 2935643, 2935779],
           dtype='int64', length=7356)

In [13]:
sales.drop(sales[sales['item_cnt_day'] <= 0].index, inplace=True)

In [14]:
sales[sales['item_cnt_day'] < 0].index

Int64Index([], dtype='int64')

In [29]:
sales.shape

(2928492, 11)

In [ ]:
# 2.년(year), 월(month), 일(day) 로 date를 분리하기

In [15]:
sales['date'].str.split(',', expand=True)

                  0
0        02.01.2013
1        03.01.2013
3        06.01.2013
4        15.01.2013
5        10.01.2013
...             ...
2935844  10.10.2015
2935845  09.10.2015
2935846  14.10.2015
2935847  22.10.2015
2935848  03.10.2015

[2928492 rows x 1 columns]

In [27]:
sales[['day','month','year']] = sales['date'].str.split('.', expand=True)

In [28]:
sales

,date,shop_id,item_id,item_price,item_cnt_day,day,month,year,income,y_m,m_d
0,02.01.2013,59,22154,999.00,1.0,02,01,2013,999.00,2013년 01월,01월 02일
1,03.01.2013,25,2552,899.00,1.0,03,01,2013,899.00,2013년 01월,01월 03일
3,06.01.2013,25,2554,1709.05,1.0,06,01,2013,1709.05,2013년 01월,01월 06일
4,15.01.2013,25,2555,1099.00,1.0,15,01,2013,1099.00,2013년 01월,01월 15일
5,10.01.2013,25,2564,349.00,1.0,10,01,2013,349.00,2013년 01월,01월 10일
...,...,...,...,...,...,...,...,...,...,...,...
2935844,10.10.2015,25,7409,299.00,1.0,10,10,2015,299.00,2015년 10월,10월 10일
2935845,09.10.2015,25,7460,299.00,1.0,09,10,2015,299.00,2015년 10월,10월 09일
2935846,14.10.2015,25,7459,349.00,1.0,14,10,2015,349.00,2015년 10월,10월 14일
2935847,22.10.2015,25,7440,299.00,1.0,22,10,2015,299.00,2015년 10월,10월 22일
2935848,03.10.2015,25,7460,299.00,1.0,03,10,2015,299.00,2015년 10월,10월 03일

In [ ]:
# 3. 수입(income), 연일(y_m), 월일(m_d) 데이터 만들기

In [18]:
sales['income'] = sales['item_price'] * sales['item_cnt_day']

In [19]:
sales['income']

0           999.00
1           899.00
3          1709.05
4          1099.00
5           349.00
            ...
2935844     299.00
2935845     299.00
2935846     349.00
2935847     299.00
2935848     299.00
Name: income, Length: 2928492, dtype: float64

In [20]:
sales

,date,shop_id,item_id,item_price,item_cnt_day,day,month,year,income
0,02.01.2013,59,22154,999.00,1.0,02,01,2013,999.00
1,03.01.2013,25,2552,899.00,1.0,03,01,2013,899.00
3,06.01.2013,25,2554,1709.05,1.0,06,01,2013,1709.05
4,15.01.2013,25,2555,1099.00,1.0,15,01,2013,1099.00
5,10.01.2013,25,2564,349.00,1.0,10,01,2013,349.00
...,...,...,...,...,...,...,...,...,...
2935844,10.10.2015,25,7409,299.00,1.0,10,10,2015,299.00
2935845,09.10.2015,25,7460,299.00,1.0,09,10,2015,299.00
2935846,14.10.2015,25,7459,349.00,1.0,14,10,2015,349.00
2935847,22.10.2015,25,7440,299.00,1.0,22,10,2015,299.00
2935848,03.10.2015,25,7460,299.00,1.0,03,10,2015,299.00

## 연월(y_m) 만들기

In [21]:
sales['y_m'] = sales['year'] + '년 ' + sales['month'] + '월'

In [22]:
sales

,date,shop_id,item_id,item_price,item_cnt_day,day,month,year,income,y_m
0,02.01.2013,59,22154,999.00,1.0,02,01,2013,999.00,2013년 01월
1,03.01.2013,25,2552,899.00,1.0,03,01,2013,899.00,2013년 01월
3,06.01.2013,25,2554,1709.05,1.0,06,01,2013,1709.05,2013년 01월
4,15.01.2013,25,2555,1099.00,1.0,15,01,2013,1099.00,2013년 01월
5,10.01.2013,25,2564,349.00,1.0,10,01,2013,349.00,2013년 01월
...,...,...,...,...,...,...,...,...,...,...
2935844,10.10.2015,25,7409,299.00,1.0,10,10,2015,299.00,2015년 10월
2935845,09.10.2015,25,7460,299.00,1.0,09,10,2015,299.00,2015년 10월
2935846,14.10.2015,25,7459,349.00,1.0,14,10,2015,349.00,2015년 10월
2935847,22.10.2015,25,7440,299.00,1.0,22,10,2015,299.00,2015년 10월
2935848,03.10.2015,25,7460,299.00,1.0,03,10,2015,299.00,2015년 10월

## 월일(m_d) 만들기

In [23]:
sales['m_d'] = sales['month'] + '월 ' + sales['day'] + '일'

In [24]:
sales

,date,shop_id,item_id,item_price,item_cnt_day,day,month,year,income,y_m,m_d
0,02.01.2013,59,22154,999.00,1.0,02,01,2013,999.00,2013년 01월,01월 02일
1,03.01.2013,25,2552,899.00,1.0,03,01,2013,899.00,2013년 01월,01월 03일
3,06.01.2013,25,2554,1709.05,1.0,06,01,2013,1709.05,2013년 01월,01월 06일
4,15.01.2013,25,2555,1099.00,1.0,15,01,2013,1099.00,2013년 01월,01월 15일
5,10.01.2013,25,2564,349.00,1.0,10,01,2013,349.00,2013년 01월,01월 10일
...,...,...,...,...,...,...,...,...,...,...,...
2935844,10.10.2015,25,7409,299.00,1.0,10,10,2015,299.00,2015년 10월,10월 10일
2935845,09.10.2015,25,7460,299.00,1.0,09,10,2015,299.00,2015년 10월,10월 09일
2935846,14.10.2015,25,7459,349.00,1.0,14,10,2015,349.00,2015년 10월,10월 14일
2935847,22.10.2015,25,7440,299.00,1.0,22,10,2015,299.00,2015년 10월,10월 22일
2935848,03.10.2015,25,7460,299.00,1.0,03,10,2015,299.00,2015년 10월,10월 03일

In [ ]:
#년, 월, 일 구분하기 (강사님 방법)

In [30]:
sales['date'].head(1)

0    02.01.2013
Name: date, dtype: object

In [31]:
pd.to_datetime(sales['date'], format = '%d.%m.%Y')

0         2013-01-02
1         2013-01-03
3         2013-01-06
4         2013-01-15
5         2013-01-10
             ...
2935844   2015-10-10
2935845   2015-10-09
2935846   2015-10-14
2935847   2015-10-22
2935848   2015-10-03
Name: date, Length: 2928492, dtype: datetime64[ns]

In [ ]:
sales['day', 'month', 'year'] = sales['date'].str.split(',', expand=True)

In [33]:
sales.head(1)

,date,shop_id,item_id,item_price,item_cnt_day,day,month,year,income,y_m,m_d
0,02.01.2013,59,22154,999.0,1.0,02,01,2013,999.0,2013년 01월,01월 02일

In [34]:
sales['year'].value_counts() #15년도 데이터가 상대적으로 왜 작을지 의문 품기

2013    1264490
2014    1053211
2015     610791
Name: year, dtype: int64

In [35]:
sales['y_m'].unique() #15년도 중 11월, 12월 데이터가 없기 때문에 다른 연도에 비해 상대적으로 데이터가 적을 수 밖에 없음

array(['2013년 01월', '2013년 02월', '2013년 03월', '2013년 04월', '2013년 05월',
       '2013년 06월', '2013년 07월', '2013년 08월', '2013년 09월', '2013년 10월',
       '2013년 11월', '2013년 12월', '2014년 01월', '2014년 02월', '2014년 03월',
       '2014년 04월', '2014년 05월', '2014년 06월', '2014년 07월', '2014년 08월',
       '2014년 09월', '2014년 10월', '2014년 11월', '2014년 12월', '2015년 01월',
       '2015년 02월', '2015년 03월', '2015년 04월', '2015년 05월', '2015년 06월',
       '2015년 07월', '2015년 08월', '2015년 09월', '2015년 10월'], dtype=object)

In [36]:
sales['month'].value_counts()

01    302546
03    283349
12    273410
02    269471
08    247835
06    236914
07    234324
04    227740
10    226493
05    224378
09    219304
11    182728
Name: month, dtype: int64

In [37]:
sales['day'].value_counts() #31일 데이터가 가장 적음. 왜? 월마다 31일이 계속 있지 않기 때문

02    103081
07    102064
23    101117
22    101105
08    100718
21    100004
28     99576
27     98743
03     98725
06     97808
30     97209
20     96777
26     95907
05     95158
19     94716
04     94192
01     94182
25     93228
24     93113
16     92631
15     92399
17     92205
12     92099
14     91841
09     91775
13     90780
29     90709
18     90389
10     89838
11     88964
31     67439
Name: day, dtype: int64

데이터 사이언티스트는 데이터 분석 노트 !!!!!! 필수!!!!!

In [38]:
sales['y_m'].unique()

array(['2013년 01월', '2013년 02월', '2013년 03월', '2013년 04월', '2013년 05월',
       '2013년 06월', '2013년 07월', '2013년 08월', '2013년 09월', '2013년 10월',
       '2013년 11월', '2013년 12월', '2014년 01월', '2014년 02월', '2014년 03월',
       '2014년 04월', '2014년 05월', '2014년 06월', '2014년 07월', '2014년 08월',
       '2014년 09월', '2014년 10월', '2014년 11월', '2014년 12월', '2015년 01월',
       '2015년 02월', '2015년 03월', '2015년 04월', '2015년 05월', '2015년 06월',
       '2015년 07월', '2015년 08월', '2015년 09월', '2015년 10월'], dtype=object)

In [39]:
len(sales['y_m'].unique())

34

## mapping 해보기

In [ ]:
#내가 직접 맵핑한 것

In [53]:
sales_map = {}

for value, key in enumerate(sales['y_m'].unique()) :
    if value >= 34 :
        sales_map[key] = 34
    else :
        sales_map[key] = value
    print(value, key)

0 2013년 01월
1 2013년 02월
2 2013년 03월
3 2013년 04월
4 2013년 05월
5 2013년 06월
6 2013년 07월
7 2013년 08월
8 2013년 09월
9 2013년 10월
10 2013년 11월
11 2013년 12월
12 2014년 01월
13 2014년 02월
14 2014년 03월
15 2014년 04월
16 2014년 05월
17 2014년 06월
18 2014년 07월
19 2014년 08월
20 2014년 09월
21 2014년 10월
22 2014년 11월
23 2014년 12월
24 2015년 01월
25 2015년 02월
26 2015년 03월
27 2015년 04월
28 2015년 05월
29 2015년 06월
30 2015년 07월
31 2015년 08월
32 2015년 09월
33 2015년 10월

In [ ]:
# 강사님이 맵핑하신 것

In [48]:
ym_mapping = {}

for value, key in enumerate(sales['y_m'].unique()) :
    ym_mapping[key] = value + 1
    print(value+1, key)

1 2013년 01월
2 2013년 02월
3 2013년 03월
4 2013년 04월
5 2013년 05월
6 2013년 06월
7 2013년 07월
8 2013년 08월
9 2013년 09월
10 2013년 10월
11 2013년 11월
12 2013년 12월
13 2014년 01월
14 2014년 02월
15 2014년 03월
16 2014년 04월
17 2014년 05월
18 2014년 06월
19 2014년 07월
20 2014년 08월
21 2014년 09월
22 2014년 10월
23 2014년 11월
24 2014년 12월
25 2015년 01월
26 2015년 02월
27 2015년 03월
28 2015년 04월
29 2015년 05월
30 2015년 06월
31 2015년 07월
32 2015년 08월
33 2015년 09월
34 2015년 10월

In [49]:
ym_mapping

{'2013년 01월': 1,
 '2013년 02월': 2,
 '2013년 03월': 3,
 '2013년 04월': 4,
 '2013년 05월': 5,
 '2013년 06월': 6,
 '2013년 07월': 7,
 '2013년 08월': 8,
 '2013년 09월': 9,
 '2013년 10월': 10,
 '2013년 11월': 11,
 '2013년 12월': 12,
 '2014년 01월': 13,
 '2014년 02월': 14,
 '2014년 03월': 15,
 '2014년 04월': 16,
 '2014년 05월': 17,
 '2014년 06월': 18,
 '2014년 07월': 19,
 '2014년 08월': 20,
 '2014년 09월': 21,
 '2014년 10월': 22,
 '2014년 11월': 23,
 '2014년 12월': 24,
 '2015년 01월': 25,
 '2015년 02월': 26,
 '2015년 03월': 27,
 '2015년 04월': 28,
 '2015년 05월': 29,
 '2015년 06월': 30,
 '2015년 07월': 31,
 '2015년 08월': 32,
 '2015년 09월': 33,
 '2015년 10월': 34}

In [ ]:
# 맵핑 다른 방법

In [ ]:
[i for i in range(10)] # list comprehension

ym mapping 하기 (강사님 version)

In [54]:
ym_mapping = {key: value + 1 for value, key in enumerate(sales['y_m'].unique())}

In [55]:
ym_mapping

{'2013년 01월': 1,
 '2013년 02월': 2,
 '2013년 03월': 3,
 '2013년 04월': 4,
 '2013년 05월': 5,
 '2013년 06월': 6,
 '2013년 07월': 7,
 '2013년 08월': 8,
 '2013년 09월': 9,
 '2013년 10월': 10,
 '2013년 11월': 11,
 '2013년 12월': 12,
 '2014년 01월': 13,
 '2014년 02월': 14,
 '2014년 03월': 15,
 '2014년 04월': 16,
 '2014년 05월': 17,
 '2014년 06월': 18,
 '2014년 07월': 19,
 '2014년 08월': 20,
 '2014년 09월': 21,
 '2014년 10월': 22,
 '2014년 11월': 23,
 '2014년 12월': 24,
 '2015년 01월': 25,
 '2015년 02월': 26,
 '2015년 03월': 27,
 '2015년 04월': 28,
 '2015년 05월': 29,
 '2015년 06월': 30,
 '2015년 07월': 31,
 '2015년 08월': 32,
 '2015년 09월': 33,
 '2015년 10월': 34}

In [56]:
sales['y_m2'] = sales['y_m'].map(ym_mapping)

In [57]:
sales['y_m2'].value_counts().sort_index()[:3]

1    115338
2    108326
3    121053
Name: y_m2, dtype: int64

md mapping 하기

In [72]:
md_mapping = {key: value + 1 for value, key in enumerate(md)}

In [73]:
md_mapping

{'01월 01일': 1,
 '01월 02일': 2,
 '01월 03일': 3,
 '01월 04일': 4,
 '01월 05일': 5,
 '01월 06일': 6,
 '01월 07일': 7,
 '01월 08일': 8,
 '01월 09일': 9,
 '01월 10일': 10,
 '01월 11일': 11,
 '01월 12일': 12,
 '01월 13일': 13,
 '01월 14일': 14,
 '01월 15일': 15,
 '01월 16일': 16,
 '01월 17일': 17,
 '01월 18일': 18,
 '01월 19일': 19,
 '01월 20일': 20,
 '01월 21일': 21,
 '01월 22일': 22,
 '01월 23일': 23,
 '01월 24일': 24,
 '01월 25일': 25,
 '01월 26일': 26,
 '01월 27일': 27,
 '01월 28일': 28,
 '01월 29일': 29,
 '01월 30일': 30,
 '01월 31일': 31,
 '02월 01일': 32,
 '02월 02일': 33,
 '02월 03일': 34,
 '02월 04일': 35,
 '02월 05일': 36,
 '02월 06일': 37,
 '02월 07일': 38,
 '02월 08일': 39,
 '02월 09일': 40,
 '02월 10일': 41,
 '02월 11일': 42,
 '02월 12일': 43,
 '02월 13일': 44,
 '02월 14일': 45,
 '02월 15일': 46,
 '02월 16일': 47,
 '02월 17일': 48,
 '02월 18일': 49,
 '02월 19일': 50,
 '02월 20일': 51,
 '02월 21일': 52,
 '02월 22일': 53,
 '02월 23일': 54,
 '02월 24일': 55,
 '02월 25일': 56,
 '02월 26일': 57,
 '02월 27일': 58,
 '02월 28일': 59,
 '03월 01일': 60,
 '03월 02일': 61,
 '03월 03일': 62,
 '03월 04일': 63,
 '03월 05일': 64,
 '03월 06일': 65,
 '03월 07일': 66,
 '03월 08일': 67,
 '03월 09일': 68,
 '03월 10일': 69,
 '03월 11일': 70,
 '03월 12일': 71,
 '03월 13일': 72,
 '03월 14일': 73,
 '03월 15일': 74,
 '03월 16일': 75,
 '03월 17일': 76,
 '03월 18일': 77,
 '03월 19일': 78,
 '03월 20일': 79,
 '03월 21일': 80,
 '03월 22일': 81,
 '03월 23일': 82,
 '03월 24일': 83,
 '03월 25일': 84,
 '03월 26일': 85,
 '03월 27일': 86,
 '03월 28일': 87,
 '03월 29일': 88,
 '03월 30일': 89,
 '03월 31일': 90,
 '04월 01일': 91,
 '04월 02일': 92,
 '04월 03일': 93,
 '04월 04일': 94,
 '04월 05일': 95,
 '04월 06일': 96,
 '04월 07일': 97,
 '04월 08일': 98,
 '04월 09일': 99,
 '04월 10일': 100,
 '04월 11일': 101,
 '04월 12일': 102,
 '04월 13일': 103,
 '04월 14일': 104,
 '04월 15일': 105,
 '04월 16일': 106,
 '04월 17일': 107,
 '04월 18일': 108,
 '04월 19일': 109,
 '04월 20일': 110,
 '04월 21일': 111,
 '04월 22일': 112,
 '04월 23일': 113,
 '04월 24일': 114,
 '04월 25일': 115,
 '04월 26일': 116,
 '04월 27일': 117,
 '04월 28일': 118,
 '04월 29일': 119,
 '04월 30일': 120,
 '05월 01일': 121,
 '05월 02일': 122,
 '05월 03일': 123,
 '05월 04일': 124,
 '05월 05일': 125,
 '05월 06일': 126,
 '05월 07일': 127,
 '05월 08일': 128,
 '05월 09일': 129,
 '05월 10일': 130,
 '05월 11일': 131,
 '05월 12일': 132,
 '05월 13일': 133,
 '05월 14일': 134,
 '05월 15일': 135,
 '05월 16일': 136,
 '05월 17일': 137,
 '05월 18일': 138,
 '05월 19일': 139,
 '05월 20일': 140,
 '05월 21일': 141,
 '05월 22일': 142,
 '05월 23일': 143,
 '05월 24일': 144,
 '05월 25일': 145,
 '05월 26일': 146,
 '05월 27일': 147,
 '05월 28일': 148,
 '05월 29일': 149,
 '05월 30일': 150,
 '05월 31일': 151,
 '06월 01일': 152,
 '06월 02일': 153,
 '06월 03일': 154,
 '06월 04일': 155,
 '06월 05일': 156,
 '06월 06일': 157,
 '06월 07일': 158,
 '06월 08일': 159,
 '06월 09일': 160,
 '06월 10일': 161,
 '06월 11일': 162,
 '06월 12일': 163,
 '06월 13일': 164,
 '06월 14일': 165,
 '06월 15일': 166,
 '06월 16일': 167,
 '06월 17일': 168,
 '06월 18일': 169,
 '06월 19일': 170,
 '06월 20일': 171,
 '06월 21일': 172,
 '06월 22일': 173,
 '06월 23일': 174,
 '06월 24일': 175,
 '06월 25일': 176,
 '06월 26일': 177,
 '06월 27일': 178,
 '06월 28일': 179,
 '06월 29일': 180,
 '06월 30일': 181,
 '07월 01일': 182,
 '07월 02일': 183,
 '07월 03일': 184,
 '07월 04일': 185,
 '07월 05일': 186,
 '07월 06일': 187,
 '07월 07일': 188,
 '07월 08일': 189,
 '07월 09일': 190,
 '07월 10일': 191,
 '07월 11일': 192,
 '07월 12일': 193,
 '07월 13일': 194,
 '07월 14일': 195,
 '07월 15일': 196,
 '07월 16일': 197,
 '07월 17일': 198,
 '07월 18일': 199,
 '07월 19일': 200,
 '07월 20일': 201,
 '07월 21일': 202,
 '07월 22일': 203,
 '07월 23일': 204,
 '07월 24일': 205,
 '07월 25일': 206,
 '07월 26일': 207,
 '07월 27일': 208,
 '07월 28일': 209,
 '07월 29일': 210,
 '07월 30일': 211,
 '07월 31일': 212,
 '08월 01일': 213,
 '08월 02일': 214,
 '08월 03일': 215,
 '08월 04일': 216,
 '08월 05일': 217,
 '08월 06일': 218,
 '08월 07일': 219,
 '08월 08일': 220,
 '08월 09일': 221,
 '08월 10일': 222,
 '08월 11일': 223,
 '08월 12일': 224,
 '08월 13일': 225,
 '08월 14일': 226,
 '08월 15일': 227,
 '08월 16일': 228,
 '08월 17일': 229,
 '08월 18일': 230,
 '08월 19일': 231,
 '08월 20일': 232,
 '08월 21일': 233,
 '08월 22일': 234,
 '08월 23일': 235,
 '08월 24일': 236,
 '08월 25일': 237,
 '08월 26일': 238,
 '08월 27일': 239,
 '08월 28일': 240,
 '08월 29일': 241,
 '08월 30일': 242,
 '08월 31일': 243,
 '09월 01일': 244,
 '09월 02일': 245,
 '09월 03일': 246,
 '09월 04일': 247,
 '09월 05일': 248,
 '09월 06일': 249,
 '09월 07일': 250,
 '09월 08일': 251,
 '09월 09일': 252,
 '09월 10일': 253,
 '09월 11일': 254,
 '09월 12일': 255,
 '09월 13일': 256,
 '09월 14일': 257,
 '09월 15일': 258,
 '09월 16일': 259,
 '09월 17일': 260,
 '09월 18일': 261,
 '09월 19일': 262,
 '09월 20일': 263,
 '09월 21일': 264,
 '09월 22일': 265,
 '09월 23일': 266,
 '09월 24일': 267,
 '09월 25일': 268,
 '09월 26일': 269,
 '09월 27일': 270,
 '09월 28일': 271,
 '09월 29일': 272,
 '09월 30일': 273,
 '10월 01일': 274,
 '10월 02일': 275,
 '10월 03일': 276,
 '10월 04일': 277,
 '10월 05일': 278,
 '10월 06일': 279,
 '10월 07일': 280,
 '10월 08일': 281,
 '10월 09일': 282,
 '10월 10일': 283,
 '10월 11일': 284,
 '10월 12일': 285,
 '10월 13일': 286,
 '10월 14일': 287,
 '10월 15일': 288,
 '10월 16일': 289,
 '10월 17일': 290,
 '10월 18일': 291,
 '10월 19일': 292,
 '10월 20일': 293,
 '10월 21일': 294,
 '10월 22일': 295,
 '10월 23일': 296,
 '10월 24일': 297,
 '10월 25일': 298,
 '10월 26일': 299,
 '10월 27일': 300,
 '10월 28일': 301,
 '10월 29일': 302,
 '10월 30일': 303,
 '10월 31일': 304,
 '11월 01일': 305,
 '11월 02일': 306,
 '11월 03일': 307,
 '11월 04일': 308,
 '11월 05일': 309,
 '11월 06일': 310,
 '11월 07일': 311,
 '11월 08일': 312,
 '11월 09일': 313,
 '11월 10일': 314,
 '11월 11일': 315,
 '11월 12일': 316,
 '11월 13일': 317,
 '11월 14일': 318,
 '11월 15일': 319,
 '11월 16일': 320,
 '11월 17일': 321,
 '11월 18일': 322,
 '11월 19일': 323,
 '11월 20일': 324,
 '11월 21일': 325,
 '11월 22일': 326,
 '11월 23일': 327,
 '11월 24일': 328,
 '11월 25일': 329,
 '11월 26일': 330,
 '11월 27일': 331,
 '11월 28일': 332,
 '11월 29일': 333,
 '11월 30일': 334,
 '12월 01일': 335,
 '12월 02일': 336,
 '12월 03일': 337,
 '12월 04일': 338,
 '12월 05일': 339,
 '12월 06일': 340,
 '12월 07일': 341,
 '12월 08일': 342,
 '12월 09일': 343,
 '12월 10일': 344,
 '12월 11일': 345,
 '12월 12일': 346,
 '12월 13일': 347,
 '12월 14일': 348,
 '12월 15일': 349,
 '12월 16일': 350,
 '12월 17일': 351,
 '12월 18일': 352,
 '12월 19일': 353,
 '12월 20일': 354,
 '12월 21일': 355,
 '12월 22일': 356,
 '12월 23일': 357,
 '12월 24일': 358,
 '12월 25일': 359,
 '12월 26일': 360,
 '12월 27일': 361,
 '12월 28일': 362,
 '12월 29일': 363,
 '12월 30일': 364,
 '12월 31일': 365}

In [74]:
sales['m_d2'] = sales['m_d'].map(md_mapping)

In [76]:
sales.drop(columns = ['y_m','m_d'], inplace = True)

In [77]:
sales.rename({'y_m2': 'y_m', 'm_d2':'m_d'}, axis = 1, inplace = True)

In [78]:
sales.to_csv('sales_pre.csv', index = False)

In [80]:
sales.head()

,date,shop_id,item_id,item_price,item_cnt_day,day,month,year,income,y_m,m_d
0,02.01.2013,59,22154,999.00,1.0,02,01,2013,999.00,1,2
1,03.01.2013,25,2552,899.00,1.0,03,01,2013,899.00,1,3
3,06.01.2013,25,2554,1709.05,1.0,06,01,2013,1709.05,1,6
4,15.01.2013,25,2555,1099.00,1.0,15,01,2013,1099.00,1,15
5,10.01.2013,25,2564,349.00,1.0,10,01,2013,349.00,1,10

In [75]:
sales['m_d2'].value_counts().sort_index()

1       5180
2      18584
3      17059
4      15538
5      15009
       ...
361    14232
362    16773
363    15815
364    18412
365    16072
Name: m_d2, Length: 365, dtype: int64

In [67]:
md = sales['m_d'].unique()

In [68]:
md.sort()

In [69]:
md

array(['01월 01일', '01월 02일', '01월 03일', '01월 04일', '01월 05일', '01월 06일',
       '01월 07일', '01월 08일', '01월 09일', '01월 10일', '01월 11일', '01월 12일',
       '01월 13일', '01월 14일', '01월 15일', '01월 16일', '01월 17일', '01월 18일',
       '01월 19일', '01월 20일', '01월 21일', '01월 22일', '01월 23일', '01월 24일',
       '01월 25일', '01월 26일', '01월 27일', '01월 28일', '01월 29일', '01월 30일',
       '01월 31일', '02월 01일', '02월 02일', '02월 03일', '02월 04일', '02월 05일',
       '02월 06일', '02월 07일', '02월 08일', '02월 09일', '02월 10일', '02월 11일',
       '02월 12일', '02월 13일', '02월 14일', '02월 15일', '02월 16일', '02월 17일',
       '02월 18일', '02월 19일', '02월 20일', '02월 21일', '02월 22일', '02월 23일',
       '02월 24일', '02월 25일', '02월 26일', '02월 27일', '02월 28일', '03월 01일',
       '03월 02일', '03월 03일', '03월 04일', '03월 05일', '03월 06일', '03월 07일',
       '03월 08일', '03월 09일', '03월 10일', '03월 11일', '03월 12일', '03월 13일',
       '03월 14일', '03월 15일', '03월 16일', '03월 17일', '03월 18일', '03월 19일',
       '03월 20일', '03월 21일', '03월 22일', '03월 23일', '03월 24일', '03월 25일',
       '03월 26일', '03월 27일', '03월 28일', '03월 29일', '03월 30일', '03월 31일',
       '04월 01일', '04월 02일', '04월 03일', '04월 04일', '04월 05일', '04월 06일',
       '04월 07일', '04월 08일', '04월 09일', '04월 10일', '04월 11일', '04월 12일',
       '04월 13일', '04월 14일', '04월 15일', '04월 16일', '04월 17일', '04월 18일',
       '04월 19일', '04월 20일', '04월 21일', '04월 22일', '04월 23일', '04월 24일',
       '04월 25일', '04월 26일', '04월 27일', '04월 28일', '04월 29일', '04월 30일',
       '05월 01일', '05월 02일', '05월 03일', '05월 04일', '05월 05일', '05월 06일',
       '05월 07일', '05월 08일', '05월 09일', '05월 10일', '05월 11일', '05월 12일',
       '05월 13일', '05월 14일', '05월 15일', '05월 16일', '05월 17일', '05월 18일',
       '05월 19일', '05월 20일', '05월 21일', '05월 22일', '05월 23일', '05월 24일',
       '05월 25일', '05월 26일', '05월 27일', '05월 28일', '05월 29일', '05월 30일',
       '05월 31일', '06월 01일', '06월 02일', '06월 03일', '06월 04일', '06월 05일',
       '06월 06일', '06월 07일', '06월 08일', '06월 09일', '06월 10일', '06월 11일',
       '06월 12일', '06월 13일', '06월 14일', '06월 15일', '06월 16일', '06월 17일',
       '06월 18일', '06월 19일', '06월 20일', '06월 21일', '06월 22일', '06월 23일',
       '06월 24일', '06월 25일', '06월 26일', '06월 27일', '06월 28일', '06월 29일',
       '06월 30일', '07월 01일', '07월 02일', '07월 03일', '07월 04일', '07월 05일',
       '07월 06일', '07월 07일', '07월 08일', '07월 09일', '07월 10일', '07월 11일',
       '07월 12일', '07월 13일', '07월 14일', '07월 15일', '07월 16일', '07월 17일',
       '07월 18일', '07월 19일', '07월 20일', '07월 21일', '07월 22일', '07월 23일',
       '07월 24일', '07월 25일', '07월 26일', '07월 27일', '07월 28일', '07월 29일',
       '07월 30일', '07월 31일', '08월 01일', '08월 02일', '08월 03일', '08월 04일',
       '08월 05일', '08월 06일', '08월 07일', '08월 08일', '08월 09일', '08월 10일',
       '08월 11일', '08월 12일', '08월 13일', '08월 14일', '08월 15일', '08월 16일',
       '08월 17일', '08월 18일', '08월 19일', '08월 20일', '08월 21일', '08월 22일',
       '08월 23일', '08월 24일', '08월 25일', '08월 26일', '08월 27일', '08월 28일',
       '08월 29일', '08월 30일', '08월 31일', '09월 01일', '09월 02일', '09월 03일',
       '09월 04일', '09월 05일', '09월 06일', '09월 07일', '09월 08일', '09월 09일',
       '09월 10일', '09월 11일', '09월 12일', '09월 13일', '09월 14일', '09월 15일',
       '09월 16일', '09월 17일', '09월 18일', '09월 19일', '09월 20일', '09월 21일',
       '09월 22일', '09월 23일', '09월 24일', '09월 25일', '09월 26일', '09월 27일',
       '09월 28일', '09월 29일', '09월 30일', '10월 01일', '10월 02일', '10월 03일',
       '10월 04일', '10월 05일', '10월 06일', '10월 07일', '10월 08일', '10월 09일',
       '10월 10일', '10월 11일', '10월 12일', '10월 13일', '10월 14일', '10월 15일',
       '10월 16일', '10월 17일', '10월 18일', '10월 19일', '10월 20일', '10월 21일',
       '10월 22일', '10월 23일', '10월 24일', '10월 25일', '10월 26일', '10월 27일',
       '10월 28일', '10월 29일', '10월 30일', '10월 31일', '11월 01일', '11월 02일',
       '11월 03일', '11월 04일', '11월 05일', '11월 06일', '11월 07일', '11월 08일',
       '11월 09일', '11월 10일', '11월 11일', '11월 12일', '11월 13일', '11월 14일',
       '11월 15일', '11월 16일', '11월 17일', '11월 18일', '11월 19일', '11월 20일',
       '11월 21일', '11월 22일', '11월 23일', '11월 24일', '11월 25일', '11월 26일',
       '11월 27일', '11월 28일', '11월 29일', '11월 30일', '12월 01일', '12월 02일',
       '12월 03일', '12월 04일', '12월 05일', '12월 06일', '12월 07일', '12월 08일',
       '12월 09일', '12월 10일', '12월 11일', '12월 12일', '12월 13일', '12월 14일',
       '12월 15일', '12월 16일', '12월 17일', '12월 18일', '12월 19일', '12월 20일',
       '12월 21일', '12월 22일', '12월 23일', '12월 24일', '12월 25일', '12월 26일',
       '12월 27일', '12월 28일', '12월 29일', '12월 30일', '12월 31일'],
      dtype=object)